#include <stdio.h>

int main()
{
	int n,a1,a2,a3,b1,b2,b3,c1,c2,c3;//a1,a2,a3分别表示A的时,分,秒;b1,b2,b3是B的;而c表示的是A+B的 
	int i;
	//以下输入的是测试实例个数 
	scanf("%d",&n);
	for (i=0;i<n;i++)	//有多少个实例就执行多少次
	{
		scanf("%d%d%d",&a1,&a2,&a3);	//输入A组的时,分,秒
		scanf("%d%d%d",&b1,&b2,&b3);	//输入B组的时,分,秒
		//以下计算C组数
		c3=a3+b3;	//计算未进位的c3 
		c2=c3/60;	//计算c3进了几位 
		c3=c3%60;	//计算进位后剩余的c3 
		c2+=a2+b2;	//计算加上c3的进位的c2 
		c1=c2/60;	//计算c2的进位 
		c2=c2%60;	//计算进位后的c2的剩余值 
		c1+=a1+b1;	//计算加上c2的进位的c3
		//打印c组数
		printf("%d %d %d\n",c1,c2,c3); 
	}
}
